## It is an attempt to replicate the work "An Introduction to SQLAlchemy in Python" done by Riley Predum in "towardsdatascience.com"

# Import Modules

In [1]:
import sqlalchemy
from sqlalchemy import create_engine
from sqlalchemy import Table, Column, Integer, String, MetaData, ForeignKey
from sqlalchemy import inspect

# Create Engine to connect database

In [2]:
engine = create_engine('sqlite:///chinook.db')

engine

Engine(sqlite:///chinook.db)

In [3]:
metadata = MetaData()

In [4]:
metadata.create_all(engine)

In [5]:
inspector = inspect(engine)

In [6]:
inspector.get_columns('employees')

[{'name': 'EmployeeId',
  'type': INTEGER(),
  'nullable': False,
  'default': None,
  'autoincrement': 'auto',
  'primary_key': 1},
 {'name': 'LastName',
  'type': NVARCHAR(length=20),
  'nullable': False,
  'default': None,
  'autoincrement': 'auto',
  'primary_key': 0},
 {'name': 'FirstName',
  'type': NVARCHAR(length=20),
  'nullable': False,
  'default': None,
  'autoincrement': 'auto',
  'primary_key': 0},
 {'name': 'Title',
  'type': NVARCHAR(length=30),
  'nullable': True,
  'default': None,
  'autoincrement': 'auto',
  'primary_key': 0},
 {'name': 'ReportsTo',
  'type': INTEGER(),
  'nullable': True,
  'default': None,
  'autoincrement': 'auto',
  'primary_key': 0},
 {'name': 'BirthDate',
  'type': DATETIME(),
  'nullable': True,
  'default': None,
  'autoincrement': 'auto',
  'primary_key': 0},
 {'name': 'HireDate',
  'type': DATETIME(),
  'nullable': True,
  'default': None,
  'autoincrement': 'auto',
  'primary_key': 0},
 {'name': 'Address',
  'type': NVARCHAR(length=70),
  'nullable': True,
  'default': None,
  'autoincrement': 'auto',
  'primary_key': 0},
 {'name': 'City',
  'type': NVARCHAR(length=40),
  'nullable': True,
  'default': None,
  'autoincrement': 'auto',
  'primary_key': 0},
 {'name': 'State',
  'type': NVARCHAR(length=40),
  'nullable': True,
  'default': None,
  'autoincrement': 'auto',
  'primary_key': 0},
 {'name': 'Country',
  'type': NVARCHAR(length=40),
  'nullable': True,
  'default': None,
  'autoincrement': 'auto',
  'primary_key': 0},
 {'name': 'PostalCode',
  'type': NVARCHAR(length=10),
  'nullable': True,
  'default': None,
  'autoincrement': 'auto',
  'primary_key': 0},
 {'name': 'Phone',
  'type': NVARCHAR(length=24),
  'nullable': True,
  'default': None,
  'autoincrement': 'auto',
  'primary_key': 0},
 {'name': 'Fax',
  'type': NVARCHAR(length=24),
  'nullable': True,
  'default': None,
  'autoincrement': 'auto',
  'primary_key': 0},
 {'name': 'Email',
  'type': NVARCHAR(length=60),
  'nullable': True,
  'default': None,
  'autoincrement': 'auto',
  'primary_key': 0}]

# Execute a Query

In [13]:
with engine.connect() as con:
    
    rs = con.execute("SELECT * FROM employees")
  
    for i, row in enumerate(rs):
        print(row)
        
        
con.close()

(1, 'Adams', 'Andrew', 'General Manager', None, '1962-02-18 00:00:00', '2002-08-14 00:00:00', '11120 Jasper Ave NW', 'Edmonton', 'AB', 'Canada', 'T5K 2N1', '+1 (780) 428-9482', '+1 (780) 428-3457', 'andrew@chinookcorp.com')
(2, 'Edwards', 'Nancy', 'Sales Manager', 1, '1958-12-08 00:00:00', '2002-05-01 00:00:00', '825 8 Ave SW', 'Calgary', 'AB', 'Canada', 'T2P 2T3', '+1 (403) 262-3443', '+1 (403) 262-3322', 'nancy@chinookcorp.com')
(3, 'Peacock', 'Jane', 'Sales Support Agent', 2, '1973-08-29 00:00:00', '2002-04-01 00:00:00', '1111 6 Ave SW', 'Calgary', 'AB', 'Canada', 'T2P 5M5', '+1 (403) 262-3443', '+1 (403) 262-6712', 'jane@chinookcorp.com')
(4, 'Park', 'Margaret', 'Sales Support Agent', 2, '1947-09-19 00:00:00', '2003-05-03 00:00:00', '683 10 Street SW', 'Calgary', 'AB', 'Canada', 'T2P 5G3', '+1 (403) 263-4423', '+1 (403) 263-4289', 'margaret@chinookcorp.com')
(5, 'Johnson', 'Steve', 'Sales Support Agent', 2, '1965-03-03 00:00:00', '2003-10-17 00:00:00', '7727B 41 Ave', 'Calgary', 'AB', 'Canada', 'T3B 1Y7', '1 (780) 836-9987', '1 (780) 836-9543', 'steve@chinookcorp.com')
(6, 'Mitchell', 'Michael', 'IT Manager', 1, '1973-07-01 00:00:00', '2003-10-17 00:00:00', '5827 Bowness Road NW', 'Calgary', 'AB', 'Canada', 'T3B 0C5', '+1 (403) 246-9887', '+1 (403) 246-9899', 'michael@chinookcorp.com')
(7, 'King', 'Robert', 'IT Staff', 6, '1970-05-29 00:00:00', '2004-01-02 00:00:00', '590 Columbia Boulevard West', 'Lethbridge', 'AB', 'Canada', 'T1K 5N8', '+1 (403) 456-9986', '+1 (403) 456-8485', 'robert@chinookcorp.com')
(8, 'Callahan', 'Laura', 'IT Staff', 6, '1968-01-09 00:00:00', '2004-03-04 00:00:00', '923 7 ST NW', 'Lethbridge', 'AB', 'Canada', 'T1H 1Y8', '+1 (403) 467-3351', '+1 (403) 467-8772', 'laura@chinookcorp.com')

In [14]:
with engine.connect() as con:
    
    rs = con.execute("SELECT COUNT(EmployeeId) FROM employees")
    
    for row in rs:
        print(row)
        
con.close()

(8,)

In [19]:
with engine.connect() as con:
    rs = con.execute("""SELECT SupportRepID, COUNT(SupportRepId)
                     FROM Customers 
                     GROUP BY SupportRepId;""")
    
    for row in rs:
        print(row)
        
con.close()

(3, 21)
(4, 20)
(5, 18)

In [24]:
with engine.connect() as con:
    rs = con.execute("""SELECT HireDate, EmployeeId 
                    FROM employees WHERE EmployeeId BETWEEN 3 AND 5""")
    for row in rs:
        print(row)
        
con.close()

('2002-04-01 00:00:00', 3)
('2003-05-03 00:00:00', 4)
('2003-10-17 00:00:00', 5)

In [25]:
with engine.connect() as con:
    
    rs = con.execute("""SELECT MIN(HireDate), EmployeeId
                    FROM employees;""")
    for row in rs:
        print(row)

con.close()

('2002-04-01 00:00:00', 3)

In [26]:
with engine.connect() as con:
    
    rs = con.execute("""SELECT invoices.InvoiceId as InvoId,
        invoices.BillingCountry as country,
        
        invoice_items.TrackId as invtracId,
        invoice_items.InvoiceId as invId,
        
        
        tracks.TrackId as tracId,
        SUM(tracks.Milliseconds)/(60*1000) as time
        
    FROM invoices INNER JOIN invoice_items on InvoId = invId
    INNER JOIN tracks on invtracId = tracId
    GROUP BY country
    ORDER BY time DESC;""")
    
    for row in rs:
        print(row)
        
con.close()

(5, 'USA', 99, 5, 99, 3277)
(4, 'Canada', 42, 4, 42, 1438)
(8, 'France', 234, 8, 234, 1168)
(1, 'Germany', 2, 1, 2, 914)
(25, 'Brazil', 738, 25, 738, 881)
(46, 'Czech Republic', 1434, 46, 1434, 879)
(22, 'Chile', 698, 22, 698, 525)
(11, 'United Kingdom', 274, 11, 274, 506)
(10, 'Ireland', 248, 10, 248, 476)
(28, 'Portugal', 927, 28, 927, 429)
(23, 'India', 702, 23, 702, 417)
(85, 'Hungary', 2786, 85, 2786, 380)
(78, 'Austria', 2554, 78, 2554, 374)
(53, 'Finland', 1666, 53, 1666, 355)
(32, 'Netherlands', 970, 32, 970, 305)
(2, 'Norway', 6, 2, 6, 268)
(42, 'Sweden', 1391, 42, 1391, 244)
(21, 'Australia', 695, 21, 695, 202)
(64, 'Poland', 2090, 64, 2090, 179)
(56, 'Denmark', 1855, 56, 1855, 172)
(3, 'Belgium', 16, 3, 16, 169)
(41, 'Spain', 1390, 41, 1390, 161)
(119, 'Argentina', 440, 119, 440, 149)
(63, 'Italy', 2087, 63, 2087, 138)

In [27]:
import pandas as pd

df = pd.read_sql_query("""SELECT invoices.InvoiceId as InvoId,
        invoices.BillingCountry as country,
        
        invoice_items.TrackId as invtracId,
        invoice_items.InvoiceId as invId,
        
        
        tracks.TrackId as tracId,
        SUM(tracks.Milliseconds)/(60*1000) as time
        
    FROM invoices INNER JOIN invoice_items on InvoId = invId
    INNER JOIN tracks on invtracId = tracId
    GROUP BY country
    ORDER BY time DESC;""", con = engine.connect())

In [28]:
df.head()

   InvoId  country  invtracId  invId  tracId  time
0       5      USA         99      5      99  3277
1       4   Canada         42      4      42  1438
2       8   France        234      8     234  1168
3       1  Germany          2      1       2   914
4      25   Brazil        738     25     738   881